; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Freecell is a solitaire game that comes with Windows.
;;; If you haven't seen it before:
;;;  One has 8 columns of cards, 4 freecells and 4 homecells. The
;;;  cards start in "random" (random according to MS's brain damaged RNG)
;;;  piles in the 8 columns. We can move a card in the following ways: 
;;;  1. we can move any card that is on top of a column to an empty free
;;;     cell. The free cells only take one card each.
;;;  2. we can move any card from a free cell or from top of a column to
;;;  a home cell if that home cell contains a card of the same suit
;;;  and is one lower in value (aces have value 1, Jacks 11, Queens
;;;  12, Kings 13), and to make things more symmetric we start the
;;;  homecells off containing "phone" cards with value 0.
;;;  3. we can move any card from the  top of a column or from a
;;;  freecell to the top of another column if that column currently holds
;;;  a card with an opposite colour suit that has one higher
;;;  value. 
;;;  4. we can move any card from a free cell or on top of a column to a
;;;  new column if there are less than 8 columns.
;;; The aim is to get all of the card home. The problems show quite a
;;; good variety of difficulty. 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain freecell)
  (:requirements :strips :typing)
  (:types card colnum cellnum num suit)
  (:predicates (on ?c1 - card ?c2 - card)
	       (incell ?c - card)
	       (clear ?c - card)
	       (cellspace ?n - cellnum)
	       (colspace ?n - colnum)
	       (home ?c - card)
	       (bottomcol ?c - card)
	       (canstack ?c1 - card ?c2 - card)
	       (hassuit ?c - card ?s - suit)
	       (value ?c - card ?v - num)
	       (successor ?n1 - num ?n0 - num)
	       (colsuccessor ?n1 - colnum ?n0 - colnum)
	       (cellsuccessor ?n1 - cellnum ?n0 - cellnum)
 )

;;; Move card between columns. Two versions dependent on whether or
;;; not we generate a new stack.

  (:action move
	   :parameters (?card ?oldcard ?newcard - card)
	   :precondition (and (clear ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (on ?card ?oldcard))
	   :effect (and
		    (on ?card ?newcard)
		    (clear ?oldcard)
		    (not (on ?card ?oldcard))
		    (not (clear ?newcard))))

  (:action move-b
	   :parameters (?card ?newcard - card ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and (on ?card ?newcard)
			(colspace ?ncols)
			(not (bottomcol ?card))
			(not (clear ?newcard))
			(not (colspace ?cols))))

;; Send a card to a freecell. Two versions dependent on whether or not
;; we generate a new stack.

  (:action sendtofree
	   :parameters (?card ?oldcard - card ?cells ?ncells - cellnum)
	   :precondition (and
			  (clear ?card)
			  (on ?card ?oldcard)
			  (cellspace ?cells)
			  (cellsuccessor ?cells ?ncells))
	   :effect (and
		    (incell ?card)
		    (clear ?oldcard)
		    (cellspace ?ncells)
		    (not (on ?card ?oldcard))
		    (not (clear ?card))
		    (not (cellspace ?cells))))

  (:action sendtofree-b
	   :parameters (?card - card ?cells ?ncells - cellnum ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (cellspace ?cells)
			      (cellsuccessor ?cells ?ncells)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and
		    (incell ?card)
		    (colspace ?ncols)
		    (cellspace ?ncells)
		    (not (bottomcol ?card))
		    (not (clear ?card))
		    (not (colspace ?cols))
		    (not (cellspace ?cells))))

;; Send a card a new column

(:action sendtonewcol
	 :parameters (?card ?oldcard - card ?cols ?ncols - colnum)
	 :precondition (and
			(clear ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(on ?card ?oldcard))
	 :effect (and
		  (bottomcol ?card)
		  (clear ?oldcard)
		  (colspace ?ncols)
		  (not (on ?card ?oldcard))
		  (not (colspace ?cols))))

;;Send a card home

(:action sendtohome
	 :parameters (?card ?oldcard - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num)
	 :precondition (and
			(clear ?card)
			(on ?card ?oldcard)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
	 :effect (and (home ?card)
		      (clear ?oldcard)
		      (not (on ?card ?oldcard))
                      (not (home ?homecard))
		      (not (clear ?card))))

(:action sendtohome-b
	 :parameters (?card - card ?suitname - suit  ?vcard - num
			    ?homecard - card
			    ?vhomecard - num
			    ?cols ?ncols - colnum)
	 :precondition (and (clear ?card)
			    (bottomcol ?card)
			    (home ?homecard)
			    (hassuit ?card ?suitname)
			    (hassuit ?homecard ?suitname)
			    (value ?card ?vcard)
			    (value ?homecard ?vhomecard)
			    (successor ?vcard ?vhomecard)
			    (colspace ?cols)
			    (colsuccessor ?ncols ?cols))
	 :effect (and (home ?card)
		      (colspace ?ncols)
		      (not (home ?homecard))
		      (not (clear ?card))
		      (not (bottomcol ?card))
		      (not (colspace ?cols))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Move cards in free cell
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:action homefromfreecell
	 :parameters (?card - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num
			    ?cells ?ncells - cellnum)
    ;;Send a card home from a free cell.
	 :precondition (and
			(incell ?card)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard)
			(cellspace ?cells)
			(cellsuccessor ?ncells ?cells))
	 :effect (and
		  (home ?card)
		  (cellspace ?ncells)
		  (not (incell ?card))
		  (not (cellspace ?cells))
		  (not (home ?homecard))))

(:action colfromfreecell
	 :parameters (?card ?newcard -  card ?cells ?ncells - cellnum)
	 :precondition (and  (incell ?card)
			     (clear ?newcard)
			     (canstack ?card ?newcard)
			     (cellspace ?cells)
			     (cellsuccessor ?ncells ?cells))
	 :effect (and (cellspace ?ncells)
		      (clear ?card)
		      (on ?card ?newcard)
		      (not (incell ?card))
		      (not (cellspace ?cells))
		      (not (clear ?newcard))))

(:action newcolfromfreecell
	 :parameters (?card - card ?cols ?ncols - colnum ?cells ?ncells - cellnum)
	 :precondition (and (incell ?card)
			    (colspace ?cols)
			    (cellspace ?cells)
			    (colsuccessor ?cols ?ncols)
			    (cellsuccessor ?ncells ?cells))
	 :effect (and (bottomcol ?card)
		      (clear ?card)
		      (colspace ?ncols)
		      (cellspace ?ncells)
		      (not (incell ?card))
		      (not (colspace ?cols))
		      (not (cellspace ?cells)))))

; problem
(define (problem freecell-f4-c9-s4-i9-012-112-212-312
)(:domain freecell)
(:objects 
          c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12
          h0 h1 h2 h3 h4 h5 h6 h7 h8 h9 h10 h11 h12
          s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10 s11 s12
          d0 d1 d2 d3 d4 d5 d6 d7 d8 d9 d10 d11 d12
 - card
          celln0 celln1 celln2 celln3 celln4 
 - cellnum
          coln0 coln1 coln2 coln3 coln4 coln5 coln6 coln7 coln8 coln9 
 - colnum
          n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 n11 n12 
 - num
           c h s d
 - suit
)
(:init
(value c0 n0)
(value c1 n1)
(value c2 n2)
(value c3 n3)
(value c4 n4)
(value c5 n5)
(value c6 n6)
(value c7 n7)
(value c8 n8)
(value c9 n9)
(value c10 n10)
(value c11 n11)
(value c12 n12)
(value h0 n0)
(value h1 n1)
(value h2 n2)
(value h3 n3)
(value h4 n4)
(value h5 n5)
(value h6 n6)
(value h7 n7)
(value h8 n8)
(value h9 n9)
(value h10 n10)
(value h11 n11)
(value h12 n12)
(value s0 n0)
(value s1 n1)
(value s2 n2)
(value s3 n3)
(value s4 n4)
(value s5 n5)
(value s6 n6)
(value s7 n7)
(value s8 n8)
(value s9 n9)
(value s10 n10)
(value s11 n11)
(value s12 n12)
(value d0 n0)
(value d1 n1)
(value d2 n2)
(value d3 n3)
(value d4 n4)
(value d5 n5)
(value d6 n6)
(value d7 n7)
(value d8 n8)
(value d9 n9)
(value d10 n10)
(value d11 n11)
(value d12 n12)
(cellsuccessor celln1 celln0)
(cellsuccessor celln2 celln1)
(cellsuccessor celln3 celln2)
(cellsuccessor celln4 celln3)
(colsuccessor coln1 coln0)
(colsuccessor coln2 coln1)
(colsuccessor coln3 coln2)
(colsuccessor coln4 coln3)
(colsuccessor coln5 coln4)
(colsuccessor coln6 coln5)
(colsuccessor coln7 coln6)
(colsuccessor coln8 coln7)
(colsuccessor coln9 coln8)
(successor n1 n0)
(successor n2 n1)
(successor n3 n2)
(successor n4 n3)
(successor n5 n4)
(successor n6 n5)
(successor n7 n6)
(successor n8 n7)
(successor n9 n8)
(successor n10 n9)
(successor n11 n10)
(successor n12 n11)
(hassuit c0 c)
(hassuit c1 c)
(hassuit c2 c)
(hassuit c3 c)
(hassuit c4 c)
(hassuit c5 c)
(hassuit c6 c)
(hassuit c7 c)
(hassuit c8 c)
(hassuit c9 c)
(hassuit c10 c)
(hassuit c11 c)
(hassuit c12 c)
(hassuit h0 h)
(hassuit h1 h)
(hassuit h2 h)
(hassuit h3 h)
(hassuit h4 h)
(hassuit h5 h)
(hassuit h6 h)
(hassuit h7 h)
(hassuit h8 h)
(hassuit h9 h)
(hassuit h10 h)
(hassuit h11 h)
(hassuit h12 h)
(hassuit s0 s)
(hassuit s1 s)
(hassuit s2 s)
(hassuit s3 s)
(hassuit s4 s)
(hassuit s5 s)
(hassuit s6 s)
(hassuit s7 s)
(hassuit s8 s)
(hassuit s9 s)
(hassuit s10 s)
(hassuit s11 s)
(hassuit s12 s)
(hassuit d0 d)
(hassuit d1 d)
(hassuit d2 d)
(hassuit d3 d)
(hassuit d4 d)
(hassuit d5 d)
(hassuit d6 d)
(hassuit d7 d)
(hassuit d8 d)
(hassuit d9 d)
(hassuit d10 d)
(hassuit d11 d)
(hassuit d12 d)
(canstack c2 h3)
(canstack c2 d3)
(canstack c3 h4)
(canstack c3 d4)
(canstack c4 h5)
(canstack c4 d5)
(canstack c5 h6)
(canstack c5 d6)
(canstack c6 h7)
(canstack c6 d7)
(canstack c7 h8)
(canstack c7 d8)
(canstack c8 h9)
(canstack c8 d9)
(canstack c9 h10)
(canstack c9 d10)
(canstack c10 h11)
(canstack c10 d11)
(canstack c11 h12)
(canstack c11 d12)
(canstack h2 c3)
(canstack h2 s3)
(canstack h3 c4)
(canstack h3 s4)
(canstack h4 c5)
(canstack h4 s5)
(canstack h5 c6)
(canstack h5 s6)
(canstack h6 c7)
(canstack h6 s7)
(canstack h7 c8)
(canstack h7 s8)
(canstack h8 c9)
(canstack h8 s9)
(canstack h9 c10)
(canstack h9 s10)
(canstack h10 c11)
(canstack h10 s11)
(canstack h11 c12)
(canstack h11 s12)
(canstack s2 h3)
(canstack s2 d3)
(canstack s3 h4)
(canstack s3 d4)
(canstack s4 h5)
(canstack s4 d5)
(canstack s5 h6)
(canstack s5 d6)
(canstack s6 h7)
(canstack s6 d7)
(canstack s7 h8)
(canstack s7 d8)
(canstack s8 h9)
(canstack s8 d9)
(canstack s9 h10)
(canstack s9 d10)
(canstack s10 h11)
(canstack s10 d11)
(canstack s11 h12)
(canstack s11 d12)
(canstack d2 c3)
(canstack d2 s3)
(canstack d3 c4)
(canstack d3 s4)
(canstack d4 c5)
(canstack d4 s5)
(canstack d5 c6)
(canstack d5 s6)
(canstack d6 c7)
(canstack d6 s7)
(canstack d7 c8)
(canstack d7 s8)
(canstack d8 c9)
(canstack d8 s9)
(canstack d9 c10)
(canstack d9 s10)
(canstack d10 c11)
(canstack d10 s11)
(canstack d11 c12)
(canstack d11 s12)
(home c0)
(home h0)
(home s0)
(home d0)
(cellspace celln4)
(colspace coln0)

(bottomcol h10)
(on c1 h10)
(on s10 c1)
(on d11 s10)
(on c4 d11)
(on s8 c4)
(on c5 s8)
(clear c5)

(bottomcol s9)
(clear s9)

(bottomcol d12)
(on h11 d12)
(on d8 h11)
(on s12 d8)
(on h4 s12)
(clear h4)

(bottomcol d4)
(on c8 d4)
(on d1 c8)
(on h3 d1)
(on s5 h3)
(on s7 s5)
(on c9 s7)
(clear c9)

(bottomcol c11)
(on s2 c11)
(on c12 s2)
(on d2 c12)
(on h1 d2)
(on h2 h1)
(on h12 h2)
(clear h12)

(bottomcol c10)
(on c3 c10)
(on d7 c3)
(on c2 d7)
(clear c2)

(bottomcol d9)
(on d6 d9)
(on s6 d6)
(on d3 s6)
(on d10 d3)
(on h5 d10)
(on c6 h5)
(on h7 c6)
(on s4 h7)
(clear s4)

(bottomcol h6)
(on d5 h6)
(on h9 d5)
(clear h9)

(bottomcol s3)
(on s1 s3)
(on h8 s1)
(on s11 h8)
(on c7 s11)
(clear c7)
)
(:goal
(and
(home c12)
(home h12)
(home s12)
(home d12)
)
)
)

; plan
1. (sendtofree h12 h2 celln4 celln3)
   deleted: (on h12 h2) (clear h12) (cellspace celln4)
   added: (incell h12) (clear h2) (cellspace celln3)
   goals met: 0 of 4
2. (sendtofree c2 d7 celln3 celln2)
   deleted: (on c2 d7) (clear c2) (cellspace celln3)
   added: (incell c2) (clear d7) (cellspace celln2)
   goals met: 0 of 4
3. (sendtofree h2 h1 celln2 celln1)
   deleted: (on h2 h1) (clear h2) (cellspace celln2)
   added: (incell h2) (clear h1) (cellspace celln1)
   goals met: 0 of 4
4. (sendtohome h1 d2 h n1 h0 n0)
   deleted: (on h1 d2) (home h0) (clear h1)
   added: (home h1) (clear d2)
   goals met: 0 of 4
5. (homefromfreecell h2 h n2 h1 n1 celln1 celln2)
   deleted: (incell h2) (cellspace celln1) (home h1)
   added: (home h2) (cellspace celln2)
   goals met: 0 of 4
6. (sendtofree d2 c12 celln2 celln1)
   deleted: (on d2 c12) (clear d2) (cellspace celln2)
   added: (incell d2) (clear c12) (cellspace celln1)
   goals met: 0 of 4
7. (sendtofree d7 c3 celln1 celln0)
   deleted: (on d7 c3) (clear d7) (cellspace celln1)
   added: (incell d7) (clear c3) (cellspace celln0)
   goals met: 0 of 4
8. (move c3 c10 h4)
   deleted: (on c3 c10) (clear h4)
   added: (on c3 h4) (clear c10)
   goals met: 0 of 4
9. (move h9 d5 c10)
   deleted: (on h9 d5) (clear c10)
   added: (on h9 c10) (clear d5)
   goals met: 0 of 4
10. (colfromfreecell d2 c3 celln0 celln1)
   deleted: (incell d2) (cellspace celln0) (clear c3)
   added: (cellspace celln1) (clear d2) (on d2 c3)
   goals met: 0 of 4
11. (sendtofree c5 s8 celln1 celln0)
   deleted: (on c5 s8) (clear c5) (cellspace celln1)
   added: (incell c5) (clear s8) (cellspace celln0)
   goals met: 0 of 4
12. (move s8 c4 h9)
   deleted: (on s8 c4) (clear h9)
   added: (on s8 h9) (clear c4)
   goals met: 0 of 4
13. (move s4 h7 d5)
   deleted: (on s4 h7) (clear d5)
   added: (on s4 d5) (clear h7)
   goals met: 0 of 4
14. (move h7 c6 s8)
   deleted: (on h7 c6) (clear s8)
   added: (on h7 s8) (clear c6)
   goals met: 0 of 4
15. (move c6 h5 h7)
   deleted: (on c6 h5) (clear h7)
   added: (on c6 h7) (clear h5)
   goals met: 0 of 4
16. (move c4 d11 h5)
   deleted: (on c4 d11) (clear h5)
   added: (on c4 h5) (clear d11)
   goals met: 0 of 4
17. (move d11 s10 c12)
   deleted: (on d11 s10) (clear c12)
   added: (on d11 c12) (clear s10)
   goals met: 0 of 4
18. (move s10 c1 d11)
   deleted: (on s10 c1) (clear d11)
   added: (on s10 d11) (clear c1)
   goals met: 0 of 4
19. (sendtohome c1 h10 c n1 c0 n0)
   deleted: (on c1 h10) (home c0) (clear c1)
   added: (home c1) (clear h10)
   goals met: 0 of 4
20. (homefromfreecell c2 c n2 c1 n1 celln0 celln1)
   deleted: (incell c2) (cellspace celln0) (home c1)
   added: (home c2) (cellspace celln1)
   goals met: 0 of 4
21. (sendtofree d2 c3 celln1 celln0)
   deleted: (on d2 c3) (clear d2) (cellspace celln1)
   added: (incell d2) (clear c3) (cellspace celln0)
   goals met: 0 of 4
22. (sendtohome c3 h4 c n3 c2 n2)
   deleted: (on c3 h4) (home c2) (clear c3)
   added: (home c3) (clear h4)
   goals met: 0 of 4
23. (sendtohome c4 h5 c n4 c3 n3)
   deleted: (on c4 h5) (home c3) (clear c4)
   added: (home c4) (clear h5)
   goals met: 0 of 4
24. (homefromfreecell c5 c n5 c4 n4 celln0 celln1)
   deleted: (incell c5) (cellspace celln0) (home c4)
   added: (home c5) (cellspace celln1)
   goals met: 0 of 4
25. (sendtofree h4 s12 celln1 celln0)
   deleted: (on h4 s12) (clear h4) (cellspace celln1)
   added: (incell h4) (clear s12) (cellspace celln0)
   goals met: 0 of 4
26. (sendtohome c6 h7 c n6 c5 n5)
   deleted: (on c6 h7) (home c5) (clear c6)
   added: (home c6) (clear h7)
   goals met: 0 of 4
27. (sendtohome c7 s11 c n7 c6 n6)
   deleted: (on c7 s11) (home c6) (clear c7)
   added: (home c7) (clear s11)
   goals met: 0 of 4
28. (move-b s9 h10 coln0 coln1)
   deleted: (bottomcol s9) (clear h10) (colspace coln0)
   added: (on s9 h10) (colspace coln1)
   goals met: 0 of 4
29. (sendtonewcol s11 h8 coln1 coln0)
   deleted: (on s11 h8) (colspace coln1)
   added: (bottomcol s11) (clear h8) (colspace coln0)
   goals met: 0 of 4
30. (move h8 s1 c9)
   deleted: (on h8 s1) (clear c9)
   added: (on h8 c9) (clear s1)
   goals met: 0 of 4
31. (sendtohome s1 s3 s n1 s0 n0)
   deleted: (on s1 s3) (home s0) (clear s1)
   added: (home s1) (clear s3)
   goals met: 0 of 4
32. (move h8 c9 s9)
   deleted: (on h8 c9) (clear s9)
   added: (on h8 s9) (clear c9)
   goals met: 0 of 4
33. (colfromfreecell d2 s3 celln0 celln1)
   deleted: (incell d2) (cellspace celln0) (clear s3)
   added: (cellspace celln1) (clear d2) (on d2 s3)
   goals met: 0 of 4
34. (sendtofree h5 d10 celln1 celln0)
   deleted: (on h5 d10) (clear h5) (cellspace celln1)
   added: (incell h5) (clear d10) (cellspace celln0)
   goals met: 0 of 4
35. (move d10 d3 s11)
   deleted: (on d10 d3) (clear s11)
   added: (on d10 s11) (clear d3)
   goals met: 0 of 4
36. (move d3 s6 s4)
   deleted: (on d3 s6) (clear s4)
   added: (on d3 s4) (clear s6)
   goals met: 0 of 4
37. (move s6 d6 h7)
   deleted: (on s6 d6) (clear h7)
   added: (on s6 h7) (clear d6)
   goals met: 0 of 4
38. (move c9 s7 d10)
   deleted: (on c9 s7) (clear d10)
   added: (on c9 d10) (clear s7)
   goals met: 0 of 4
39. (move s7 s5 h8)
   deleted: (on s7 s5) (clear h8)
   added: (on s7 h8) (clear s5)
   goals met: 0 of 4
40. (move d6 d9 s7)
   deleted: (on d6 d9) (clear s7)
   added: (on d6 s7) (clear d9)
   goals met: 0 of 4
41. (move s5 h3 d6)
   deleted: (on s5 h3) (clear d6)
   added: (on s5 d6) (clear h3)
   goals met: 0 of 4
42. (sendtohome h3 d1 h n3 h2 n2)
   deleted: (on h3 d1) (home h2) (clear h3)
   added: (home h3) (clear d1)
   goals met: 0 of 4
43. (sendtohome d1 c8 d n1 d0 n0)
   deleted: (on d1 c8) (home d0) (clear d1)
   added: (home d1) (clear c8)
   goals met: 0 of 4
44. (sendtohome d2 s3 d n2 d1 n1)
   deleted: (on d2 s3) (home d1) (clear d2)
   added: (home d2) (clear s3)
   goals met: 0 of 4
45. (sendtohome d3 s4 d n3 d2 n2)
   deleted: (on d3 s4) (home d2) (clear d3)
   added: (home d3) (clear s4)
   goals met: 0 of 4
46. (move-b d9 s10 coln0 coln1)
   deleted: (bottomcol d9) (clear s10) (colspace coln0)
   added: (on d9 s10) (colspace coln1)
   goals met: 0 of 4
47. (homefromfreecell h4 h n4 h3 n3 celln0 celln1)
   deleted: (incell h4) (cellspace celln0) (home h3)
   added: (home h4) (cellspace celln1)
   goals met: 0 of 4
48. (sendtofree s4 d5 celln1 celln0)
   deleted: (on s4 d5) (clear s4) (cellspace celln1)
   added: (incell s4) (clear d5) (cellspace celln0)
   goals met: 0 of 4
49. (sendtohome c8 d4 c n8 c7 n7)
   deleted: (on c8 d4) (home c7) (clear c8)
   added: (home c8) (clear d4)
   goals met: 0 of 4
50. (sendtohome-b d4 d n4 d3 n3 coln1 coln2)
   deleted: (home d3) (clear d4) (bottomcol d4) (colspace coln1)
   added: (home d4) (colspace coln2)
   goals met: 0 of 4
51. (sendtohome d5 h6 d n5 d4 n4)
   deleted: (on d5 h6) (home d4) (clear d5)
   added: (home d5) (clear h6)
   goals met: 0 of 4
52. (homefromfreecell h5 h n5 h4 n4 celln0 celln1)
   deleted: (incell h5) (cellspace celln0) (home h4)
   added: (home h5) (cellspace celln1)
   goals met: 0 of 4
53. (sendtohome-b h6 h n6 h5 n5 coln2 coln3)
   deleted: (home h5) (clear h6) (bottomcol h6) (colspace coln2)
   added: (home h6) (colspace coln3)
   goals met: 0 of 4
54. (sendtofree s5 d6 celln1 celln0)
   deleted: (on s5 d6) (clear s5) (cellspace celln1)
   added: (incell s5) (clear d6) (cellspace celln0)
   goals met: 0 of 4
55. (sendtohome d6 s7 d n6 d5 n5)
   deleted: (on d6 s7) (home d5) (clear d6)
   added: (home d6) (clear s7)
   goals met: 0 of 4
56. (homefromfreecell d7 d n7 d6 n6 celln0 celln1)
   deleted: (incell d7) (cellspace celln0) (home d6)
   added: (home d7) (cellspace celln1)
   goals met: 0 of 4
57. (sendtofree s6 h7 celln1 celln0)
   deleted: (on s6 h7) (clear s6) (cellspace celln1)
   added: (incell s6) (clear h7) (cellspace celln0)
   goals met: 0 of 4
58. (sendtohome h7 s8 h n7 h6 n6)
   deleted: (on h7 s8) (home h6) (clear h7)
   added: (home h7) (clear s8)
   goals met: 0 of 4
59. (sendtohome c9 d10 c n9 c8 n8)
   deleted: (on c9 d10) (home c8) (clear c9)
   added: (home c9) (clear d10)
   goals met: 0 of 4
60. (sendtonewcol s12 d8 coln3 coln2)
   deleted: (on s12 d8) (colspace coln3)
   added: (bottomcol s12) (clear d8) (colspace coln2)
   goals met: 0 of 4
61. (sendtohome d8 h11 d n8 d7 n7)
   deleted: (on d8 h11) (home d7) (clear d8)
   added: (home d8) (clear h11)
   goals met: 0 of 4
62. (sendtohome d9 s10 d n9 d8 n8)
   deleted: (on d9 s10) (home d8) (clear d9)
   added: (home d9) (clear s10)
   goals met: 0 of 4
63. (sendtonewcol s8 h9 coln2 coln1)
   deleted: (on s8 h9) (colspace coln2)
   added: (bottomcol s8) (clear h9) (colspace coln1)
   goals met: 0 of 4
64. (sendtohome d10 s11 d n10 d9 n9)
   deleted: (on d10 s11) (home d9) (clear d10)
   added: (home d10) (clear s11)
   goals met: 0 of 4
65. (move h11 d12 s12)
   deleted: (on h11 d12) (clear s12)
   added: (on h11 s12) (clear d12)
   goals met: 0 of 4
66. (sendtonewcol s7 h8 coln1 coln0)
   deleted: (on s7 h8) (colspace coln1)
   added: (bottomcol s7) (clear h8) (colspace coln0)
   goals met: 0 of 4
67. (sendtohome h8 s9 h n8 h7 n7)
   deleted: (on h8 s9) (home h7) (clear h8)
   added: (home h8) (clear s9)
   goals met: 0 of 4
68. (sendtohome h9 c10 h n9 h8 n8)
   deleted: (on h9 c10) (home h8) (clear h9)
   added: (home h9) (clear c10)
   goals met: 0 of 4
69. (sendtohome-b c10 c n10 c9 n9 coln0 coln1)
   deleted: (home c9) (clear c10) (bottomcol c10) (colspace coln0)
   added: (home c10) (colspace coln1)
   goals met: 0 of 4
70. (sendtonewcol s9 h10 coln1 coln0)
   deleted: (on s9 h10) (colspace coln1)
   added: (bottomcol s9) (clear h10) (colspace coln0)
   goals met: 0 of 4
71. (sendtohome-b h10 h n10 h9 n9 coln0 coln1)
   deleted: (home h9) (clear h10) (bottomcol h10) (colspace coln0)
   added: (home h10) (colspace coln1)
   goals met: 0 of 4
72. (sendtohome h11 s12 h n11 h10 n10)
   deleted: (on h11 s12) (home h10) (clear h11)
   added: (home h11) (clear s12)
   goals met: 0 of 4
73. (homefromfreecell h12 h n12 h11 n11 celln0 celln1)
   deleted: (incell h12) (cellspace celln0) (home h11)
   added: (home h12) (cellspace celln1)
   goals met: 1 of 4
74. (sendtofree s10 d11 celln1 celln0)
   deleted: (on s10 d11) (clear s10) (cellspace celln1)
   added: (incell s10) (clear d11) (cellspace celln0)
   goals met: 1 of 4
75. (sendtohome d11 c12 d n11 d10 n10)
   deleted: (on d11 c12) (home d10) (clear d11)
   added: (home d11) (clear c12)
   goals met: 1 of 4
76. (sendtohome-b d12 d n12 d11 n11 coln1 coln2)
   deleted: (home d11) (clear d12) (bottomcol d12) (colspace coln1)
   added: (home d12) (colspace coln2)
   goals met: 2 of 4
77. (sendtonewcol c12 s2 coln2 coln1)
   deleted: (on c12 s2) (colspace coln2)
   added: (bottomcol c12) (clear s2) (colspace coln1)
   goals met: 2 of 4
78. (sendtohome s2 c11 s n2 s1 n1)
   deleted: (on s2 c11) (home s1) (clear s2)
   added: (home s2) (clear c11)
   goals met: 2 of 4
79. (sendtohome-b s3 s n3 s2 n2 coln1 coln2)
   deleted: (home s2) (clear s3) (bottomcol s3) (colspace coln1)
   added: (home s3) (colspace coln2)
   goals met: 2 of 4
80. (homefromfreecell s4 s n4 s3 n3 celln0 celln1)
   deleted: (incell s4) (cellspace celln0) (home s3)
   added: (home s4) (cellspace celln1)
   goals met: 2 of 4
81. (sendtohome-b c11 c n11 c10 n10 coln2 coln3)
   deleted: (home c10) (clear c11) (bottomcol c11) (colspace coln2)
   added: (home c11) (colspace coln3)
   goals met: 2 of 4
82. (sendtohome-b c12 c n12 c11 n11 coln3 coln4)
   deleted: (home c11) (clear c12) (bottomcol c12) (colspace coln3)
   added: (home c12) (colspace coln4)
   goals met: 3 of 4
83. (homefromfreecell s5 s n5 s4 n4 celln1 celln2)
   deleted: (incell s5) (cellspace celln1) (home s4)
   added: (home s5) (cellspace celln2)
   goals met: 3 of 4
84. (homefromfreecell s6 s n6 s5 n5 celln2 celln3)
   deleted: (incell s6) (cellspace celln2) (home s5)
   added: (home s6) (cellspace celln3)
   goals met: 3 of 4
85. (sendtohome-b s7 s n7 s6 n6 coln4 coln5)
   deleted: (home s6) (clear s7) (bottomcol s7) (colspace coln4)
   added: (home s7) (colspace coln5)
   goals met: 3 of 4
86. (sendtohome-b s8 s n8 s7 n7 coln5 coln6)
   deleted: (home s7) (clear s8) (bottomcol s8) (colspace coln5)
   added: (home s8) (colspace coln6)
   goals met: 3 of 4
87. (sendtohome-b s9 s n9 s8 n8 coln6 coln7)
   deleted: (home s8) (clear s9) (bottomcol s9) (colspace coln6)
   added: (home s9) (colspace coln7)
   goals met: 3 of 4
88. (homefromfreecell s10 s n10 s9 n9 celln3 celln4)
   deleted: (incell s10) (cellspace celln3) (home s9)
   added: (home s10) (cellspace celln4)
   goals met: 3 of 4
89. (sendtohome-b s11 s n11 s10 n10 coln7 coln8)
   deleted: (home s10) (clear s11) (bottomcol s11) (colspace coln7)
   added: (home s11) (colspace coln8)
   goals met: 3 of 4
90. (sendtohome-b s12 s n12 s11 n11 coln8 coln9)
   deleted: (home s11) (clear s12) (bottomcol s12) (colspace coln8)
   added: (home s12) (colspace coln9)
   goals met: 4 of 4
